CREATE DATABASE  IF NOT EXISTS `memorizer` /*!40100 DEFAULT CHARACTER SET utf8 */;
USE `memorizer`;
-- MySQL dump 10.13  Distrib 5.6.17, for Win32 (x86)
--
-- Host: localhost    Database: memorizer
-- ------------------------------------------------------
-- Server version	5.6.19-log

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `word`
--

DROP TABLE IF EXISTS `word`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `word` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `word` varchar(45) NOT NULL,
  `structure` varchar(45) DEFAULT NULL,
  `id_language` int(11) DEFAULT NULL,
  `id_part_of_speech` int(11) unsigned DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `id_UNIQUE` (`id`),
  KEY `id_part_of_speech_idx` (`id_part_of_speech`),
  KEY `id_language_idx` (`id_language`),
  CONSTRAINT `id_part_of_speech` FOREIGN KEY (`id_part_of_speech`) REFERENCES `part_of_speech` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=293 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `word`
--

LOCK TABLES `word` WRITE;
/*!40000 ALTER TABLE `word` DISABLE KEYS */;
INSERT INTO `word` VALUES (1,'автомобиль','автомоб[и!]ль',1,1),(2,'car','car',2,1),(3,'車','くるま',3,1),(9,'замок','з[а!]мок',1,1),(10,'замок','зам[о!]к',1,1),(11,'lock','lock',2,1),(12,'hasp','hasp',2,1),(13,'吹奏楽団','すいそうがくだん',3,1),(14,'castle','castle',2,1),(15,'духовой оркестр','духов[о!]й орк[е!]стр',1,4),(16,'ров','ров',1,1),(17,'вкладчик','вкл[а!]дчик',1,1),(18,'預金者','よきんしゃ',3,1),(19,'釣堀','つりぼり',3,1),(20,'補償','ほしょう',3,1),(21,'компенсация','компенс[а!]ция',1,1),(22,'пруд с рыбками','пруд с рыбками',1,1),(23,'канал','кана!л',1,1),(24,'頭蓋骨','ずがいこつ',3,1),(25,'評判','ひょうばん',3,1),(26,'репутация','репут[а!]ция',1,1),(27,'工夫する','くふうする',3,1),(28,'委託','いたく',3,1),(29,'申請','しんせい',3,1),(30,'紛失','ふんしつ',3,1),(31,'потеря','пот[е!]ря',1,1),(32,'交響楽団','こうきょうがくだん',3,1),(33,'симфонический оркестр','симфон[и!]ческий орк[е!]стр',1,1),(34,'節電','せつでん',3,1),(35,'энергосбережение','энергосбереж[е!]ние',1,1),(36,'興す','おこす',3,1),(37,'起こす','おこす',3,1),(38,'熾す','おこす',3,1),(39,'объятия','объ[я!]тия',1,1),(40,'抱擁','ほうよう',3,1),(41,'街頭','がいとう',3,1),(42,'舞踊','ぶよう',3,1),(43,'улица','[у!]лица',1,1),(44,'танец','т[а!]нец',1,1),(45,'критика','кр[и!]тика',1,1),(46,'похвала','похвал[а!]',1,1),(49,'ключ','кл[ю!]ч',1,1),(50,'ключ','кл[ю!]ч',1,1),(51,'墓穴','ぼけつ',3,1),(52,'掘る','ほる',3,1),(54,'意図','いと',3,1),(55,'意思','いし',3,1),(61,'批判','ひはん',3,1),(62,'堀','ほり',3,1),(63,'鍵','かぎ',3,1),(64,'城','じょう',3,1),(65,'оркестр','орк[е!]стр',1,1),(66,'オーケストラ','オーケストラ',3,1),(67,'植生','しょくせい',3,1),(68,'растительность','раст[и!]тельность',1,1),(69,'支流','しりゅう',3,1),(70,'приток','прит[о!]к',1,1),(71,'эвакуация','эваку[а!]ция',1,1),(72,'避難','ひなん',3,1),(73,'隕石','いんせき',3,1),(74,'метеорит','метеор[и!]т',1,1),(75,'水星','すいせい',3,1),(76,'彗星','すいせい',3,1),(77,'комета','ком[е!]та',1,1),(78,'Меркурий','Мерк[у!]рий',1,1),(79,'火星','かせい',3,1),(80,'Марс','Марс',1,1),(81,'Нептун','Непт[у!]н',1,1),(82,'海星','かいせい',3,1),(83,'金星','きんせい',3,1),(84,'Венера','Вен[е!]ра',1,1),(85,'木星','もくせい',3,1),(86,'Юпитер','Юп[и!]тер',1,1),(87,'Сатурн','Сат[у!]рн',1,1),(88,'土星','どせい',3,1),(89,'Уран','Уран',1,1),(90,'天王星','てんのうせい',3,1),(91,'Плутон','Плут[о!]н',1,1),(92,'冥王星','めいおうせい',3,1),(93,'地球','ちきゅう',3,1),(94,'Земля','Земля',1,1),(95,'太陽系','たいようけい',3,1),(96,'Солнечная система','С[о!]лнечная сист[е!]ма',1,1),(97,'天の川','あまのがわ',3,1),(98,'Млечный Путь','Мле!чный Путь',1,1),(99,'銀河系','ぎんがけい',3,1),(100,'銀河','ぎんが',3,1),(101,'галактика','гал[а!]ктика',1,1),(102,'Луна','Луна!',1,1),(103,'妹','妹',3,1),(104,'弟','おとうと',3,1),(105,'兄','あに',3,1),(106,'姉','あね',3,1),(107,'братья и сестры','бра!тья и сё!стры',1,1),(108,'兄弟','きょうだい',3,1),(109,'父','ちち',3,1),(110,'母','はは',3,1),(111,'祖父','そふ',3,1),(112,'старший брат','старший брат',1,1),(113,'младший брат','младший брат',1,1),(114,'старшая сестра','старшая сестра',1,1),(115,'資格','しかく',3,1),(116,'квалификация','квалифика!ция',1,1),(129,'звезда','звезда',1,1),(130,'星','ほし',3,1),(135,'星座','せいざ',3,1),(136,'созвездие','созвездие',1,1),(137,'семья','семья',1,1),(138,'家族','かぞく',3,1),(140,'月','つき',3,1),(141,'Галактика','Галактика',1,1),(142,'космос','ко!смос',1,1),(143,'宇宙','うちゅう',3,1),(144,'Earth','Earth',2,1),(145,'惑星','わくせい',3,1),(146,'планета','плане!та',1,1),(191,'衛星','えいせい',3,1),(192,'спутник','сп[у!]тник',1,1),(193,'коммунизм','коммунизм',1,1),(194,'капитализм','капитали!зм',1,1),(195,'демократия','демократия',1,1),(196,'социализм','социализм',1,1),(197,'монархия','монархия',1,1),(198,'либерализм','либерализм',1,1),(199,'либертарианство','либертарианство',1,1),(200,'индивидуализм','индивидуализм',1,1),(201,'автократия','автократия',1,1),(202,'рабовладельчество','рабовладельчество',1,1),(203,'национализм','национализм',1,1),(204,'интернационализм','интернационализм',1,1),(205,'космополитизм','космополитизм',1,1),(206,'фашизм','фашизм',1,1),(207,'феодализм','феодализм',1,1),(208,'христианство','христианство',1,1),(209,'католичество','католичество',1,1),(210,'православие','православие',1,1),(211,'ислам','ислам',1,1),(212,'индуизм','индуизм',1,1),(213,'иудаизм','иудаизм',1,1),(214,'даосизм','даосизм',1,1),(215,'буддизм','буддизм',1,1),(216,'анимизм','анимизм',1,1),(217,'шаманизм','шаманизм',1,1),(218,'меритократия','меритократия',1,1),(219,'монетаризм','монетаризм',1,1),(220,'資本主義 ','しほんしゅぎ',3,1),(221,'共産主義','きょうさんしゅぎ',3,1),(222,'資本主義','しほんしゅぎ',1,1),(223,'民主主義','みんしゅしゅぎ',3,1),(224,'社会主義','しゃかいしゅぎ',3,1),(225,'君主制','くんしゅせい',3,1),(226,'自由主義','じゆうしゅぎ',3,1),(227,'リバタリアニズム','りばたりあにずむ',3,1),(228,'個人主義','こじんしゅぎ',3,1),(229,'独裁主義','どくさいしゅぎ',3,1),(230,'奴隷制度','どれいせいど',3,1),(231,'ナショナリズム','なしょなりずむ',3,1),(232,'国際主義','こくさいしゅぎ',3,1),(233,'世界主義','せかいしゅぎ',3,1),(234,'ファシズム','ふぁしずむ',3,1),(235,'封建制度','ほうけんせいど',3,1),(236,'キリスト教','きりすときょう',3,1),(237,'カトリシズム','かとりしずむ',3,1),(238,'政教','せいきょう',3,1),(239,'イスラム教','いすらむきょう',3,1),(240,'ヒンドゥー教','ヒンドゥー教',3,1),(241,'ユダヤ教','ゆだやきょう',3,1),(242,'道教','どうきょう',3,1),(243,'仏教','ぶっきょう',3,1),(244,'アニミズム','あにみずむ',3,1),(245,'シャーマニズム','しゃーまにずむ',3,1),(246,'メリトクラシー','めりとくらしー',3,1),(247,'マネタリズム','まねたりずむ',3,1),(251,'диктатура','диктату!ра',1,1),(252,'独裁政治','どくさいせいじ',3,1),(253,'компания','компания',1,1),(254,'головной офис','головной офис',1,1),(255,'филиал','филиал',1,1),(256,'департамент кадров','департамент кадров',1,1),(257,'департамент разработки','департамент разработки',1,1),(258,'департамент управелния','департамент управелния',1,1),(259,'собрание','собрание',1,1),(260,'совещание','совещание',1,1),(261,'утренний сбор','утренний сбор',1,1),(262,'вечерний сбор','вечерний сбор',1,1),(263,'президент компании','президент компании',1,1),(264,'начальник департамента','начальник департамента',1,1),(265,'начальник отдела','начальник отдела',1,1),(266,'работа','работа',1,1),(267,'разработка','разработка',1,1),(268,'тестирование','тестирование',1,1),(269,'требование','требование',1,1),(270,'спецификация','спецификация',1,1),(271,'документ','документ',1,1),(272,'материалы','материалы',1,1),(273,'会社','かいしゃ',3,1),(274,'本部','ほんぶ',3,1),(275,'支店','してん',3,1),(276,'人事部','じんじぶ',3,1),(277,'開発部','かいはつぶ',3,1),(278,'管理部','かんりぶ',3,1),(279,'会議','かいぎ',3,1),(280,'打ち合わせ','うちあわせ',3,1),(281,'朝礼','ちょうれい',3,1),(282,'終礼','しゅうれい',3,1),(283,'社長','しゃちょう',3,1),(284,'部長','ぶちょう',3,1),(285,'課長','かちょう',3,1),(286,'仕事','しごと',3,1),(287,'開発','かいはつ',3,1),(288,'検査','けんさ',3,1),(289,'要求','ようきゅう',3,1),(290,'仕様書','しようしょ',3,1),(291,'資料','しりょう',3,1),(292,'書類','しょるい',3,1);
/*!40000 ALTER TABLE `word` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2014-10-03 11:07:07
